app/controllers/yarns_controller.rb

INSERT INTO "yarns" ("user_id", "name", "quantity", "color", "project", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 2], ["name", "longmeadow "], ["quantity", 1], ["color", "mustard"], ["project", "shawl"], ["created_at", 2017-05-02 15:02:01 UTC], ["updated_at", 2017-05-02 15:02:01 UTC]]
---
  def create
  # @yarn = Yarn.new(yarn_params)
    @yarn = current_user.yarns.build(yarn_params)

    if @yarn.save

UPDATE "yarns" SET "name" = $1, "quantity" = $2, "color" = $3, "project" = $4, "updated_at" = $5 WHERE "yarns"."id" = $6  [["name", "greenwood"], ["quantity", 6], ["color", "white"], ["project", "sweater"], ["updated_at", 2017-05-02 15:11:44 UTC], ["id", 30]]
---
  def update
    if @yarn.update(yarn_params)

DELETE FROM "yarns" WHERE "yarns"."id" = $1  [["id", 3]]
---
  def destroy
    @yarn.destroy

SELECT  "yarns".* FROM "yarns" WHERE "yarns"."user_id" = $1 AND "yarns"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 13], ["LIMIT", 1]]
---
    def set_yarn
#      @yarn = Yarn.find(params[:id])
      @yarn = current_user.yarns.find(params[:id])