app/controllers/yarns_controller.rb

  def index
    @yarns = Yarn.all
---
SELECT "yarns".* FROM "yarns"